; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v13 ?v11)
             (pred_3 ?v1 ?v7)
             (pred_10 ?v13 ?v7)
             (pred_12 ?v9 ?v13 )
	     (pred_9 ?v13)
             (pred_5 ?v5)
             (pred_11 ?v1)
             (pred_1 ?v7)
             (pred_8 ?v13)
             (pred_4 ?v1)
             (pred_7 ?v13)
             (pred_2 ))



(:action op_1
:parameters (?v12 ?v8 ?v10 ?v3)
:precondition (and (pred_5 ?v12) (pred_5 ?v8) (pred_11 ?v10) (pred_1 ?v3)
          (pred_6 ?v12 ?v8) (pred_3 ?v10 ?v3)
                   (pred_10 ?v8 ?v3) (pred_9 ?v12) 
                   (pred_8 ?v8) (pred_4 ?v10))
:effect (and  (pred_7 ?v8) (not (pred_8 ?v8))))


(:action op_5
:parameters (?v12 ?v6)
:precondition (and (pred_5 ?v12) (pred_5 ?v6)
               (pred_9 ?v12) (pred_6 ?v12 ?v6) (pred_7 ?v6))
:effect (and (pred_9 ?v6) (not (pred_9 ?v12))))

(:action op_2
:parameters (?v12 ?v10)
:precondition (and (pred_5 ?v12) (pred_11 ?v10) 
                  (pred_9 ?v12) (pred_12 ?v10 ?v12) (pred_2 ))
:effect (and (pred_4 ?v10)
   (not (pred_12 ?v10 ?v12)) (not (pred_2 ))))


(:action op_4
:parameters (?v12 ?v4 ?v2)
:precondition (and (pred_5 ?v12) (pred_11 ?v4) (pred_11 ?v2)
                  (pred_9 ?v12) (pred_4 ?v2) (pred_12 ?v4 ?v12))
:effect (and (pred_4 ?v4) (pred_12 ?v2 ?v12)
        (not (pred_4 ?v2)) (not (pred_12 ?v4 ?v12))))

(:action op_3
:parameters (?v12 ?v10)
:precondition (and (pred_5 ?v12) (pred_11 ?v10) 
                  (pred_9 ?v12) (pred_4 ?v10))
:effect (and (pred_2 ) (pred_12 ?v10 ?v12) (not (pred_4 ?v10)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_08 obj_03 obj_14 obj_11 obj_16 obj_05 obj_10 obj_01 obj_18 obj_07 obj_13 obj_02 obj_09 obj_15 obj_20
    obj_17 obj_06
    obj_12 obj_19 obj_21
    )

    (:init
       (pred_2)

       (pred_5 obj_04)
       (pred_5 obj_08)
       (pred_5 obj_03)
       (pred_5 obj_14)
       (pred_5 obj_11)
       (pred_5 obj_16)
       (pred_5 obj_05)
       (pred_5 obj_10)
       (pred_5 obj_01)
       (pred_5 obj_18)
       (pred_5 obj_07)
       (pred_5 obj_13)
       (pred_5 obj_02)
       (pred_5 obj_09)
       (pred_5 obj_15)
       (pred_5 obj_20)
       (pred_1 obj_17)
       (pred_1 obj_06)
       (pred_11 obj_12)
       (pred_11 obj_19)
       (pred_11 obj_21)

       (pred_6 obj_04 obj_11)
       (pred_6 obj_04 obj_08)
       (pred_6 obj_08 obj_16)
       (pred_6 obj_08 obj_03)
       (pred_6 obj_08 obj_04)
       (pred_6 obj_03 obj_05)
       (pred_6 obj_03 obj_14)
       (pred_6 obj_03 obj_08)
       (pred_6 obj_14 obj_10)
       (pred_6 obj_14 obj_03)
       (pred_6 obj_11 obj_01)
       (pred_6 obj_11 obj_16)
       (pred_6 obj_11 obj_04)
       (pred_6 obj_16 obj_18)
       (pred_6 obj_16 obj_05)
       (pred_6 obj_16 obj_08)
       (pred_6 obj_16 obj_11)
       (pred_6 obj_05 obj_07)
       (pred_6 obj_05 obj_10)
       (pred_6 obj_05 obj_03)
       (pred_6 obj_05 obj_16)
       (pred_6 obj_10 obj_13)
       (pred_6 obj_10 obj_14)
       (pred_6 obj_10 obj_05)
       (pred_6 obj_01 obj_02)
       (pred_6 obj_01 obj_18)
       (pred_6 obj_01 obj_11)
       (pred_6 obj_18 obj_09)
       (pred_6 obj_18 obj_07)
       (pred_6 obj_18 obj_16)
       (pred_6 obj_18 obj_01)
       (pred_6 obj_07 obj_15)
       (pred_6 obj_07 obj_13)
       (pred_6 obj_07 obj_05)
       (pred_6 obj_07 obj_18)
       (pred_6 obj_13 obj_20)
       (pred_6 obj_13 obj_10)
       (pred_6 obj_13 obj_07)
       (pred_6 obj_02 obj_09)
       (pred_6 obj_02 obj_01)
       (pred_6 obj_09 obj_15)
       (pred_6 obj_09 obj_18)
       (pred_6 obj_09 obj_02)
       (pred_6 obj_15 obj_20)
       (pred_6 obj_15 obj_07)
       (pred_6 obj_15 obj_09)
       (pred_6 obj_20 obj_13)
       (pred_6 obj_20 obj_15)
       (pred_8 obj_20)
       (pred_8 obj_13)
       (pred_8 obj_03)
       (pred_10  obj_20 obj_17)
       (pred_10  obj_13 obj_06)
       (pred_10  obj_03 obj_17)
       (pred_7 obj_04)
       (pred_7 obj_08)
       (pred_7 obj_14)
       (pred_7 obj_11)
       (pred_7 obj_16)
       (pred_7 obj_05)
       (pred_7 obj_10)
       (pred_7 obj_01)
       (pred_7 obj_18)
       (pred_7 obj_07)
       (pred_7 obj_02)
       (pred_7 obj_09)
       (pred_7 obj_15)

       (pred_3  obj_12 obj_17)
       (pred_3  obj_19 obj_06)
       (pred_3  obj_21 obj_17)
       (pred_12 obj_12 obj_11)
       (pred_12 obj_19 obj_11)
       (pred_12 obj_21 obj_18)
       (pred_9 obj_08)
    )

    (:goal (and
       (pred_12 obj_12 obj_02)
       (pred_12 obj_19 obj_01)
       (pred_12 obj_21 obj_05)
    ))
(:constraints
  (always (not (pred_9 obj_16)))
)
)

; plan
1. (op_5 obj_08 obj_04)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_04)
   goals met: 0 of 3
2. (op_5 obj_04 obj_11)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_11)
   goals met: 0 of 3
3. (op_2 obj_11 obj_19)
   deleted: (pred_12 obj_19 obj_11) (pred_2)
   added: (pred_4 obj_19)
   goals met: 0 of 3
4. (op_5 obj_11 obj_01)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_01)
   goals met: 0 of 3
5. (op_3 obj_01 obj_19)
   deleted: (pred_4 obj_19)
   added: (pred_2) (pred_12 obj_19 obj_01)
   goals met: 1 of 3
6. (op_5 obj_01 obj_18)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_18)
   goals met: 1 of 3
7. (op_2 obj_18 obj_21)
   deleted: (pred_12 obj_21 obj_18) (pred_2)
   added: (pred_4 obj_21)
   goals met: 1 of 3
8. (op_5 obj_18 obj_01)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_01)
   goals met: 1 of 3
9. (op_5 obj_01 obj_11)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_11)
   goals met: 1 of 3
10. (op_4 obj_11 obj_12 obj_21)
   deleted: (pred_4 obj_21) (pred_12 obj_12 obj_11)
   added: (pred_4 obj_12) (pred_12 obj_21 obj_11)
   goals met: 1 of 3
11. (op_5 obj_11 obj_01)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_01)
   goals met: 1 of 3
12. (op_5 obj_01 obj_02)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_02)
   goals met: 1 of 3
13. (op_3 obj_02 obj_12)
   deleted: (pred_4 obj_12)
   added: (pred_2) (pred_12 obj_12 obj_02)
   goals met: 2 of 3
14. (op_5 obj_02 obj_01)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_01)
   goals met: 2 of 3
15. (op_5 obj_01 obj_11)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_11)
   goals met: 2 of 3
16. (op_2 obj_11 obj_21)
   deleted: (pred_12 obj_21 obj_11) (pred_2)
   added: (pred_4 obj_21)
   goals met: 2 of 3
17. (op_5 obj_11 obj_04)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_04)
   goals met: 2 of 3
18. (op_5 obj_04 obj_08)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_08)
   goals met: 2 of 3
19. (op_1 obj_08 obj_03 obj_21 obj_17)
   deleted: (pred_8 obj_03)
   added: (pred_7 obj_03)
   goals met: 2 of 3
20. (op_5 obj_08 obj_03)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_03)
   goals met: 2 of 3
21. (op_5 obj_03 obj_05)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_05)
   goals met: 2 of 3
22. (op_3 obj_05 obj_21)
   deleted: (pred_4 obj_21)
   added: (pred_2) (pred_12 obj_21 obj_05)
   goals met: 3 of 3
